app/controllers/albums_controller.rb

SELECT "albums".* FROM "albums"
---
def index
    @title = "List of Albums"
    @albums = Album.all

INSERT INTO "albums" ("album_art", "name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["album_art", ""], ["name", "smooth album"], ["user_id", 5], ["created_at", "2021-06-11 07:20:18.744048"], ["updated_at", "2021-06-11 07:20:18.744048"]]
---
def create
    @album = Album.new(album_params)
    @album.user = current_user
    if @album.save

UPDATE "albums" SET "updated_at" = $1 WHERE "albums"."id" = $2  [["updated_at", "2021-06-11 08:00:45.750028"], ["id", 29]]
---
def update
    @album = set_album
	@album.user = current_user
	 if @album.update(album_params)

DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 23]]
---
def destroy
    @album = set_album
	@album.user = current_user
    if current_user == @album.user
	   @album.destroy

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
---
def set_album
    Album.find(params[:id])