app/controllers/artists_controller.rb

SELECT "users".* FROM "users"
---
    def index
        @title = "List of Artist"
        @artists = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "albums" WHERE "albums"."user_id" = $1  [["user_id", 2]]
---
    def show
        @heading = "created albums"
        @user = User.find(params[:id])
        @albums = @user.albums.all
        @total_album = @user.albums.count